package org.example.vpn_bot.Enum;

import lombok.Getter;

@Getter
public enum Settings {
    IPHONE("*ИНСТРУКЦИЯ*\n" +
            "\n" +
            "*Личным ключом делиться с другими людьми нельзя (будут глюки и низкая скорость).*\n" +
            "\n" +
            "1. Скопируй личный ключ доступа.\n" +
            "   (не открыть ссылку, а скопировать) \n" +
            " \n" +
            "\n" +
            "2. Открой приложение v2RayTun.\n" +
            "   (скачать) [v2RayTun для iOS](https://apps.apple.com/ru/app/v2raytun/id6476628951).\n" +
            "   В приложении в верхнем правом углу экрана найди значок ”+” (плюс) и нажми на него.\n" +
            "\n" +
            "3. Выбери пункт ”Добавить из буфера”.\n" +
            "\n" +
            "4. Откроется список стран, выбираем в зависимости от задачи:\n" +
            "\n" +
            "   \uD83C\uDDE9\uD83C\uDDEA Germany и \uD83C\uDDF3\uD83C\uDDF1 Netherlands — основные, быстрые и универсальные локации.  \n" +
            "   \uD83C\uDDF7\uD83C\uDDFA Russia - используется только для YouTube без рекламы.  \n" +
            "\n" +
            "Готово!  \n" +
            "Приятного пользования \uD83D\uDE4F\n"),
    ANDROID("*ИНСТРУКЦИЯ*\n" +
            "\n" +
            "*Личным ключом делиться с другими людьми нельзя (будут глюки и низкая скорость).*\n" +
            "\n" +
            "1. Скопируй личный ключ доступа.\n" +
            "   (не открыть ссылку, а скопировать) \n" +
            "\n" +
            "2. Открой приложение v2RayTun.\n" +
            "   (скачать) [v2RayTun для Android](https://play.google.com/store/apps/details?id=com.v2raytun.android).\n" +
            "   В приложении в верхнем правом углу экрана найди значок ”+” (плюс) и нажми на него.\n" +
            "\n" +
            "3. Выбери пункт ”Импорт из буфера обмена”.\n" +
            "\n" +
            "4. Откроется список стран, выбираем в зависимости от задачи:\n" +
            "\n" +
            "   \uD83C\uDDE9\uD83C\uDDEA Germany и \uD83C\uDDF3\uD83C\uDDF1 Netherlands — основные, быстрые и универсальные локации.  \n" +
            "   \uD83C\uDDF7\uD83C\uDDFA Russia - используется только для YouTube без рекламы.\n" +
            "\n" +
            "Готово!  \n" +
            "Приятного пользования \uD83D\uDE4F\n"),
    MAC("*ИНСТРУКЦИЯ*\n" +
            "\n" +
            "*Личным ключом делиться с другими людьми нельзя (будут глюки и низкая скорость).*\n" +
            "\n" +
            "1. Скопируй личный ключ доступа.\n" +
            "   (не открыть ссылку, а скопировать)\uD83D\uDC47\n" +
            "\n" +
            "2. Открой приложение Hiddify.\n" +
            "   (скачать) [Hiddify для MacOS](https://github.com/hiddify/hiddify-next/releases/latest/download/Hiddify-MacOS.dmg).\n" +
            "   В приложении в верхнем правом углу экрана найди значок ”+” (плюс) и нажми на него.\n" +
            "\n" +
            "3. Выбери пункт ”Добавить из буфера обмена”.\n" +
            "\n" +
            "Готово!  \n" +
            "Приятного пользования \uD83D\uDE4F\n"),
    WINDOWS("*ИНСТРУКЦИЯ*\n" +
            "\n" +
            "*Личным ключом делиться с другими людьми нельзя (будут глюки и низкая скорость).*\n" +
            "\n" +
            "1. Скопируй личный ключ доступа.\n" +
            "   (не открыть ссылку, а скопировать)\uD83D\uDC47\n" +
            "\n" +
            "2. Открой приложение Hiddify.\n" +
            "   (скачать) [Hiddify для Windows](https://github.com/hiddify/hiddify-next/releases/latest/download/Hiddify-Windows-Setup-x64.exe).\n" +
            "   В приложении в верхнем правом углу экрана найди значок ”+” (плюс) и нажми на него.\n" +
            "\n" +
            "3. Выбери пункт ”Добавить из буфера обмена”.\n" +
            "\n" +
            "Готово!  \n" +
            "Приятного пользования \uD83D\uDE4F\n"),
    TV("*ИНСТРУКЦИЯ ПО НАСТРОЙКЕ VPN НА ТВ*\n" +
            "\n" +
            "1. На телевизоре в магазине приложений Google Play Market скачиваем наше VPN-приложение v2raytun.\n" +
            "\n" +
            "2. Затем скачиваем на телефон приложение Remote for AndroidTV (управление телевизором через телефон) \n" +
            "   [скачать из App Store](https://apps.apple.com/ru/app/remote-for-android-tv/id1668755298). С помощью этого приложения соединяем телефон с телевизором.\n" +
            "\n" +
            "3. Как только соедините телефон с телевизором, приступаем к следующему пункту.\n" +
            "\n" +
            "4. Копируем свой ключ доступа (не открываем, а копируем!) \uD83D\uDC47\n" +
            "\n" +
            "5. На телевизоре открываем наше VPN-приложение v2raytun (оно же v2).\n" +
            "\n" +
            "6. А на телефоне открываем приложение Remote for AndroidTV и, управляя телевизором через телефон, на телевизоре в приложении v2 выбираем *Управление* -> *Ручной ввод*.\n" +
            "\n" +
            "7. На телефоне в приложении Remote for AndroidTV откроется окошко для ввода.\n" +
            "\n" +
            "8. В это окошко вставляем скопированный ключ доступа (из шага 4).\n" +
            "\n" +
            "9. Нажимаем «Готово».\n" +
            "\n" +
            "Теперь настройка завершена, и ваше VPN-приложение готово к использованию! \uD83D\uDE4F\n");
    private final String text;
    Settings(String text){
        this.text = text;
    }
}

